Show / Hide Table of Contents
Class ConcreteULSCheckResultDiagramCapacity
ULS Check Diagram Capacity base
Inheritance
System.Object
ConcreteCheckResultBase
ConcreteULSCheckResultDiagramCapacity
ConcreteULSCheckResultDiagramCapacityEc2
Inherited Members
 ConcreteCheckResultBase.InternalFores
 ConcreteCheckResultBase.NonConformities
 ConcreteCheckResultBase.Result
 ConcreteCheckResultBase.CheckValue
 ConcreteCheckResultBase.LimitCheckValue
 ConcreteCheckResultBase.Check
 System.Object.ToString()
 System.Object.Equals(System.Object)
 System.Object.Equals(System.Object, System.Object)
 System.Object.ReferenceEquals(System.Object, System.Object)
 System.Object.GetHashCode()
 System.Object.GetType()
 System.Object.MemberwiseClone()
Namespace: IdeaRS.OpenModel.Concrete.CheckResult
Assembly: IdeaRS.OpenModel.dll
Syntax
public abstract class ConcreteULSCheckResultDiagramCapacity : ConcreteCheckResultBase
Properties
Improve this Doc   View Source
Fu
calculated ultimate internal forces
Declaration
public ResultOfInternalForces Fu { get; set; }
Property Value
 Type |  Description
 ResultOfInternalForces
Improve this Doc   View Source
Fu1
calculated ultimate internal forces
Declaration
public ResultOfInternalForces Fu1 { get; set; }
Property Value
 Type |  Description
 ResultOfInternalForces
Improve this Doc   View Source
Fu2
calculated ultimate internal forces
Declaration
public ResultOfInternalForces Fu2 { get; set; }
Property Value
 Type |  Description
 ResultOfInternalForces
Improve this Doc   View Source
CheckMethod
method of check
Declaration
public IntDiagCheckMethod CheckMethod { get; set; }
Property Value
 Type |  Description
 IntDiagCheckMethod
 Improve this Doc
 View Source